#! usr/bin/perl

#Задание 1.
#Тебе нужно написать скрипт, который будет принимать на вход из командной строки один параметр
# - имя пользователя (user_name). Внутри скрипта нужно объявить массив @users_list с
# именами пользователей ( достаточно 3х человек).

#Задача:
#Запустить твой скрипт, передав туда в качестве параметра имя пользователя из объявленного тобой массива.
#  Принять переданный параметр в переменную с помощью дескриптора стандартного ввода <STDIN>.
#     И, если такой пользователь в массиве - есть, вывести на экран сообщение
#  "Добро пожаловать, $user_name !", а если такого пользователя нет
# - вывести на экран сообщение "Ты кто такой, $user_name?!".

#   Что мы узнаем:
#1. Получение данный из <STDIN>.
# 2. Циклы
#  3. Логическое сравнение if

#  Подсказка:
##1. За циклом нужно взвести переменную $find. Если перебирая
#  пользователей в цикле ты нашел нужного, то переменной присваивается 1.
#2. Вывод сообщений должен быть ЗА циклом. Там ты проверяешь,
# если $find = 1, то выводим Добро пожаловать, $user_name !, а если нет, то "Ты кто такой, $user_name?!".

# Полезные привычки:
#1. Давай переменным сразу внятные имена
#   2. Цикл оформляй так: for my $user_name(@users_list){....}
# Тем самым каждый пользователь из списка будет попадать в переменную с
# понятным именем $user_name. В начале работы с циклом, введи в тело цикла вывод отладки,
#  чтобы пощупать всё самому:
#for my $user_name(@users_list) {
#   print "Processing with user $user_name from \@users_list \n";
# Решёткой обозначается комментарий - такие строчки не выполняются
# ещё здесь можно и нужно делать пометки для себя и твоих последователей)
# Например, \n в конце вывода - это перевод строки, попробуй с ним и без него.
#              3. В любой непонятной ситуации - принтуй, не верь себе и написанному ни тобой, ни кем либо)
# 4. Сразу напиши use strict; и use warnings; в первых строках и прочитай, что они дают в коде.

use strict;
use warnings;


my @users_list = ("Mike", "Jack", "Kek");

print "Enter name: ";
my $user = <STDIN>;
chomp($user);

my $find = 0;


for my $user_name(@users_list){
    print "Processing with user $user_name from \@users_list \n";
    if ($user eq $user_name) {
        $find = 1;
        last;
    }
}

if ($find == 1) {
    print "Добро пожаловать, $user !\n";
} else {
    print "Ты кто такой, $user?!\n";
}


